using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using WebLab.Data.interfaces;
using WebLab.Data.Models;

namespace WebLab.Data.mocks
{
    public class MockCategory : IGameCategory
    {
        public IEnumerable<Category> AllCategories 
        {
            get
            {
                return new List<Category>
                {
                    new Category {Id = 1, CategoryName = "Екшн", Desc = " поєднує в собі драматичний жанр ігор разом з нестримними діями:" +
                                                                " бійки, автомобільні переслідування, вибухи, стрілянину і таке інше." +
                                                                " Жанр, в основному, показує самостійні намагання героя відновити справедливість," +
                                                                " що нерідко переростає у маленьку війну."},

                    new Category {Id = 2, CategoryName = "Стратегії", Desc = " жанр відеоігор, в якому запорукою досягнення перемоги є планування і стратегічне мислення." +
                                                                     " Можуть містити різну тематику: зокрема військових, економічних, суспільствознавчих симуляторів тощо.", },
                    new Category {Id = 3,  CategoryName = "Гонки", Desc = " Жанр відеоігор, в якому гравець керує автомобілем." +
                                                                  " Для гри в автосимулятори можна користуватися клавіатурою та мишею або використовувати спеціальний контролер — комп'ютерне кермо, коробку передач та педалі.", },
                    new Category {Id = 4,  CategoryName = "Казуальні", Desc = "відеоігри, призначені для широкого кола користувачів.", },
                    new Category {Id = 5,  CategoryName = "Спорт", Desc = "це жанр відеоігор, основою ігрового процесу якого є правила реального або вигаданого виду спорту." +
                                                                  " Ігри жанру можуть робити акцент на різних аспектах спорту, від самого процесу гри і до його планування та менеджменту учасників.", },
                    new Category {Id = 6,  CategoryName = "Пригоди", Desc = "жанр відеоігор, основу ігрового процесу яких складає вирішення поставлених завдань шляхом їх обдумування, уважного пошуку підказок і схованих деталей." +
                                                                    " Такі ігри можуть як мати одного чи кількох головних персонажів, так і не мати їх взагалі.", },
                     new Category {Id = 7, CategoryName = "Всі", Desc = "Всі доступні", }
                };
            }
        }
    }
}
